samples/counter/impl/DestroyRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:rl="http://docs.oasis-open.org/wsrf/rl-2" xmlns:count="http://counter.com/CounterService"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>http://docs.oasis-open.org/wsrf/rlw-2/ImmediateResourceTermination/DestroyRequest</wsa:Action>
        <wsa:MessageID>Moo</wsa:MessageID>
        <wsa:To>http://localhost:8080/CounterService</wsa:To>
        <wsa:ReferenceParameters>
            <count:CounterId>Moo</count:CounterId>
        </wsa:ReferenceParameters>
    </soapenv:Header>
    <soapenv:Body>
        <rl:Destroy/>
    </soapenv:Body>
</soapenv:Envelope>
